Revit 2027 API
FailureHandlingOptions.SetClearAfterRollback Method
 Sets a flag indicating that Revit should clear all posted failures silently when the failing transaction is being rolled back intentionally. If not set, the failures may still be displayed to the user during rollback.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureHandlingOptions SetClearAfterRollback(
	bool bFlag
)
Public Function SetClearAfterRollback (
	bFlag As Boolean
) As FailureHandlingOptions
public:
FailureHandlingOptions^ SetClearAfterRollback(
	bool bFlag
)
member SetClearAfterRollback :
        bFlag : bool -> FailureHandlingOptions
Parameters
bFlag Boolean
 True to clear posted failures silently if the transaction is being rolled back, false to keep these failures in place (they may be displayed to the user).
Return Value
FailureHandlingOptions
 This FailureHandlingOptions object.
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace